org/OrgMode/2015-01-31-Use-Emacs-Org-Mode-Write-Github-Post.org
#+OPTIONS: num:nil
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+AUTHOR: Zhengchao Xu
#+EMAIL: xuzhengchaojob@gmail.com

#+BEGIN_HTML
---
layout: post
title: 使用OrgMode撰写博客
category: [OrgMode]
tag: [emacs, orgmode]
description: [A brief description about how to write post with orgmode]
---
#+END_HTML

本文的主要目的是介绍本博客的架构, 以及说明如何用[[http://xuzhengchao.com/orgmode/org-mode-outline.html][OrgMode]] 来体验纯文本写作的快乐, 
就像你们用markdown所做的那样.

/注1: 本博客搭建在github之上, 关于如何在github上搭建blog, 网上一搜有N多的教程./
/注2: 本博客的模板使用了[[http://painterlin.com/pages/about.html][PainterLin]] 同学的开源模板并做了一点UI修改./


* 更新记录
** Emacs 24.4.1 + org mode 8.2.10(Mac)
 换了mac后,又下载了最新的24.4.1版本, 发现之前的脚本不能用了.
 现在是写了一个publish 工程, 然后再emacs里执行org-publish命令完成.

 #+BEGIN_SRC lisp
 ;; =============== Org Publish =====================
 (setq org-publish-project-alist
       '(("github-blog"
	  :base-directory "/Users/douhua/lx/github/blog/org/post/"
	  :publishing-directory "/Users/douhua/lx/github/blog/_posts/"
	  ;;:base-directory "/Users/douhua/lx/org/post/"
	  ;;:publishing-directory "/Users/douhua/lx/org/_posts/"
	  :prepare-function nil
	  :completion-function nil
	  :exclude "*.html"
	  :recursive nil
	  :base-extension "org"
	  :publishing-function org-html-publish-to-html
	  :body-only t
	  )))

 #+END_SRC
