_posts/OrgMode/2015-01-31-Use-Emacs-Org-Mode-Write-Github-Post.html
---
layout: post
title: 使用OrgMode撰写博客
category: [OrgMode]
tag: [emacs, orgmode]
description: [A brief description about how to write post with orgmode]
---

<p>
本文的主要目的是介绍本博客的架构, 以及说明如何用<a href="http://xuzhengchao.com/orgmode/org-mode-outline.html">OrgMode</a> 来体验纯文本写作的快乐, 
就像你们用markdown所做的那样.
</p>

<p>
<i>注1: 本博客搭建在github之上, 关于如何在github上搭建blog, 网上一搜有N多的教程.</i>
<i>注2: 本博客的模板使用了<a href="http://painterlin.com/pages/about.html">PainterLin</a> 同学的开源模板并做了一点UI修改.</i>
</p>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">更新记录</h2>
<div class="outline-text-2" id="text-orgheadline2">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">Emacs 24.4.1 + org mode 8.2.10(Mac)</h3>
<div class="outline-text-3" id="text-orgheadline1">
<p>
换了mac后,又下载了最新的24.4.1版本, 发现之前的脚本不能用了.
现在是写了一个publish 工程, 然后再emacs里执行org-publish命令完成.
</p>

<div class="org-src-container">

<pre class="src src-lisp">;; =============== Org Publish =====================
(setq org-publish-project-alist
      '(("github-blog"
	 :base-directory "/Users/douhua/lx/github/blog/org/post/"
	 :publishing-directory "/Users/douhua/lx/github/blog/_posts/"
	 ;;:base-directory "/Users/douhua/lx/org/post/"
	 ;;:publishing-directory "/Users/douhua/lx/org/_posts/"
	 :prepare-function nil
	 :completion-function nil
	 :exclude "*.html"
	 :recursive nil
	 :base-extension "org"
	 :publishing-function org-html-publish-to-html
	 :body-only t
	 )))
</pre>
</div>
</div>
</div>
</div>
